{"question_id": 1, "label": "E", "text": "I love meeting lots of new people at gatherings; I move around and talk to whoever seems interesting."}
{"question_id": 1, "label": "E", "text": "I naturally bounce between groups because I enjoy hearing different conversations and high energy."}
{"question_id": 1, "label": "E", "text": "I rarely stay in one place at a party—I go introduce myself to new people constantly"}
{"question_id": 1, "label": "E", "text": "I tend to mingle widely because it feels fun to meet as many people as possible."}
{"question_id": 1, "label": "E", "text": "I like drifting around the room and jumping into new conversations."}
{"question_id": 1, "label": "E", "text": "I talk to different groups since I enjoy the buzz of a lively crowd."}
{"question_id": 1, "label": "E", "text": "I usually start conversations with people I’ve never met before; it energizes me"}
{"question_id": 1, "label": "E", "text": "I move around to keep the social energy going instead of staying with just one group."}
{"question_id": 1, "label": "E", "text": "I introduce myself to people and jump between groups because it’s exciting."}
{"question_id": 1, "label": "E", "text": "I enjoy the energy of meeting many different people rather than sticking to one circle."}
{"question_id": 1, "label": "I", "text": "I prefer staying with a small group of familiar people because it feels more comfortable"}
{"question_id": 1, "label": "I", "text": "I usually stick with the friends I came with instead of mingling widely."}
{"question_id": 1, "label": "I", "text": "I tend to stay in one corner talking to one or two people I’m close to"}
{"question_id": 1, "label": "I", "text": "I feel most comfortable having deeper conversations with a few people rather than meeting new ones."}
{"question_id": 1, "label": "I", "text": "I don’t move around a lot; I stay where I feel safe and familiar."}
{"question_id": 1, "label": "I", "text": "I talk to the same few people the whole time instead of circulating through the event."}
{"question_id": 1, "label": "I", "text": "I stick to familiar faces because big social mixing feels draining."}
{"question_id": 1, "label": "I", "text": "I stay with people I know well and avoid hopping between groups"}
{"question_id": 1, "label": "I", "text": "I enjoy intimate conversations more, so I don’t try to meet many new people."}
{"question_id": 1, "label": "I", "text": "I’m content staying with one small group instead of moving around the whole event."}
{"question_id": 1, "label": "E", "text": "I seek out lots of new people."}
{"question_id": 1, "label": "I", "text": "I stick with a few familiar ones."}
{"question_id": 1, "label": "E", "text": "I spend my time seeking out lots of new people."}
{"question_id": 1, "label": "I", "text": "I spenf my time sticking with a few familiar ones."}

{"question_id": 8, "label": "E", "text": "After long social events I usually feel upbeat and energized."}
{"question_id": 8, "label": "E", "text": "Spending time with people leaves me refreshed and excited."}
{"question_id": 8, "label": "E", "text": "The more I interact socially, the more energized I feel."}
{"question_id": 8, "label": "E", "text": "I often feel pumped up after a long day around others."}
{"question_id": 8, "label": "E", "text": "Being around people helps me recharge."}
{"question_id": 8, "label": "E", "text": "Social events usually give me a burst of energy."}
{"question_id": 8, "label": "E", "text": "I come home from gatherings feeling lively, not tired."}
{"question_id": 8, "label": "E", "text": "Long social interactions make me feel connected and invigorated."}
{"question_id": 8, "label": "E", "text": "I gain energy from engaging with groups for extended periods."}
{"question_id": 8, "label": "E", "text": "Talking to many people boosts my mood rather than exhausting me."}
{"question_id": 8, "label": "E", "text": "After long periods of social interaction, I usually feel energized and refreshed"}
{"question_id": 8, "label": "E", "text": "energized and refreshed"}

{"question_id": 8, "label": "I", "text": "After a long day of social interaction I feel completely drained."}
{"question_id": 8, "label": "I", "text": "Spending lots of time with others tires me out and I need quiet afterward."}
{"question_id": 8, "label": "I", "text": "Prolonged socializing usually leaves me exhausted."}
{"question_id": 8, "label": "I", "text": "After group events I just want to be alone to recharge."}
{"question_id": 8, "label": "I", "text": "Interacting for long periods drains my mental energy quickly."}
{"question_id": 8, "label": "I", "text": "I feel worn out after spending too much time around people."}
{"question_id": 8, "label": "I", "text": "Being social for hours makes me crave solitude."}
{"question_id": 8, "label": "I", "text": "I usually need a break alone after big social gatherings."}
{"question_id": 8, "label": "I", "text": "Extended interactions overwhelm me and I need to decompress alone."}
{"question_id": 8, "label": "I", "text": "Social activities drain me instead of energizing me."}
{"question_id": 8, "label": "I", "text": "After long periods of social interaction, I usually feel drained and in need of alone time"}
{"question_id": 8, "label": "I", "text": "drained and in need of alone time"}

{"question_id": 15, "label": "E", "text": "I’m always eager to meet people and share experiences with them."}
{"question_id": 15, "label": "E", "text": "Connecting with others feels exciting and natural for me."}
{"question_id": 15, "label": "E", "text": "I love being around people and engaging in shared activities."}
{"question_id": 15, "label": "E", "text": "I enjoy jumping into conversations and group experiences."}
{"question_id": 15, "label": "E", "text": "I actively look for opportunities to connect with people."}
{"question_id": 15, "label": "E", "text": "Sharing experiences with others energizes me."}
{"question_id": 15, "label": "E", "text": "I usually start conversations easily and enjoy group dynamics."}
{"question_id": 15, "label": "E", "text": "I like being involved socially and meeting new people."}
{"question_id": 15, "label": "E", "text": "I’m enthusiastic about social interactions and shared moments."}
{"question_id": 15, "label": "E", "text": "I naturally gravitate toward connecting with lots of people."}
{"question_id": 15, "label": "E", "text": "I find myself eager to connect with people and share experiences"}
{"question_id": 15, "label": "E", "text": "eager to connect with people and share experiences"}
{"question_id": 15, "label": "E", "text": "eager to connect and share experiences"}

{"question_id": 15, "label": "I", "text": "I’m more reserved and prefer deeper one-on-one conversations."}
{"question_id": 15, "label": "I", "text": "I value quiet reflection over constant interaction."}
{"question_id": 15, "label": "I", "text": "I tend to observe first and speak more during meaningful conversations."}
{"question_id": 15, "label": "I", "text": "I prefer connecting deeply with a few people rather than many."}
{"question_id": 15, "label": "I", "text": "I usually keep to myself unless I feel comfortable."}
{"question_id": 15, "label": "I", "text": "I enjoy thoughtful, intimate conversations more than group discussions."}
{"question_id": 15, "label": "I", "text": "I tend to stay reflective and reserved in social settings."}
{"question_id": 15, "label": "I", "text": "I’m not quick to share experiences unless the connection feels meaningful."}
{"question_id": 15, "label": "I", "text": "One-on-one interactions feel more genuine and comfortable to me."}
{"question_id": 15, "label": "I", "text": "I prefer quiet moments and deeper conversations to group activities."}
{"question_id": 15, "label": "I", "text": "I find myself more reserved and reflective, preferring deeper one-on-one interactions"}
{"question_id": 15, "label": "I", "text": "more reserved and reflective, preferring deeper one-on-one interactions"}

{"question_id": 22, "label": "E", "text": "I prefer to improvise during social interactions and go with the flow."}
{"question_id": 22, "label": "E", "text": "I usually speak spontaneously without rehearsing what I’ll say."}
{"question_id": 22, "label": "E", "text": "I feel comfortable improvising in conversations."}
{"question_id": 22, "label": "E", "text": "I jump into conversations naturally without much planning."}
{"question_id": 22, "label": "E", "text": "I tend to express my thoughts as they come to me."}
{"question_id": 22, "label": "E", "text": "I don’t overthink what I’ll say; I just get into the moment."}
{"question_id": 22, "label": "E", "text": "I like the spontaneity of unscripted social interactions."}
{"question_id": 22, "label": "E", "text": "I’m more of an improv communicator than a planner."}
{"question_id": 22, "label": "E", "text": "In conversations I speak freely and adjust as needed."}
{"question_id": 22, "label": "E", "text": "I feel relaxed talking without preparing ahead of time."}
{"question_id": 22, "label": "E", "text": "I prefer to improvise as I go"}
{"question_id": 22, "label": "E", "text": "improvise as I go"}
{"question_id": 22, "label": "E", "text": "improvise"}

{"question_id": 22, "label": "I", "text": "I often rehearse what I’m going to say before speaking."}
{"question_id": 22, "label": "I", "text": "I like to prepare mentally before entering social situations."}
{"question_id": 22, "label": "I", "text": "I script or rehearse conversations in my head in advance."}
{"question_id": 22, "label": "I", "text": "I think through my words before saying them out loud."}
{"question_id": 22, "label": "I", "text": "I get nervous improvising, so I plan what I’ll say first."}
{"question_id": 22, "label": "I", "text": "I prefer to reflect before I respond in social settings."}
{"question_id": 22, "label": "I", "text": "I feel more confident when I’ve rehearsed my thoughts beforehand."}
{"question_id": 22, "label": "I", "text": "I typically organize my thoughts before speaking socially."}
{"question_id": 22, "label": "I", "text": "I’m careful with my wording and often prepare what to say."}
{"question_id": 22, "label": "I", "text": "Improvising makes me anxious, so I prefer planning my responses."}
{"question_id": 22, "label": "I", "text": "I tend to rehearse what I’ll say in social situations"}
{"question_id": 22, "label": "I", "text": "rehearse what I’ll say in social situations"}
{"question_id": 22, "label": "I", "text": "rehearse what I’ll say"}

{"question_id": 29, "label": "E", "text": "I usually walk up and introduce myself when I meet someone new."}
{"question_id": 29, "label": "E", "text": "Starting conversations with strangers comes naturally to me."}
{"question_id": 29, "label": "E", "text": "I'm often the first one to say hello in new social situations."}
{"question_id": 29, "label": "E", "text": "I enjoy initiating conversations and getting to know people right away."}
{"question_id": 29, "label": "E", "text": "I like breaking the ice when I meet someone for the first time."}
{"question_id": 29, "label": "E", "text": "Approaching new people feels easy and energizing for me."}
{"question_id": 29, "label": "E", "text": "I don't wait—I introduce myself and get the conversation going."}
{"question_id": 29, "label": "E", "text": "I'm comfortable taking the lead when meeting someone new."}
{"question_id": 29, "label": "E", "text": "I tend to make the first move in conversations with strangers."}
{"question_id": 29, "label": "E", "text": "I'm often the one to break the silence and start talking."}
{"question_id": 29, "label": "E", "text": "In a social gathering, I usually find myself initiating conversations"}
{"question_id": 29, "label": "E", "text": "initiate conversations"}

{"question_id": 29, "label": "I", "text": "I usually wait for others to approach me when meeting new people."}
{"question_id": 29, "label": "I", "text": "I feel more comfortable letting others start the conversation first."}
{"question_id": 29, "label": "I", "text": "I rarely initiate introductions unless I have to."}
{"question_id": 29, "label": "I", "text": "I prefer observing and getting a feel for people before engaging."}
{"question_id": 29, "label": "I", "text": "Starting conversations with strangers doesn't come naturally to me."}
{"question_id": 29, "label": "I", "text": "I usually wait until someone talks to me before I open up."}
{"question_id": 29, "label": "I", "text": "I tend to keep to myself in new social situations until approached."}
{"question_id": 29, "label": "I", "text": "I'm more likely to listen quietly than initiate when meeting new people."}
{"question_id": 29, "label": "I", "text": "I often avoid being the first to speak when I don't know someone yet."}
{"question_id": 29, "label": "I", "text": "I prefer when others take the lead in starting conversations."}
{"question_id": 29, "label": "I", "text": "In a social gathering, I wait for others to approach me"}
{"question_id": 29, "label": "I", "text": "wait for others to approach me"}
