[
    {
      "id": 1,
      "question": "When you’re at a social gathering, how do you usually spend your time — seeking out lots of new people, or sticking with a few familiar ones?",
      "dichotomy": "E/I",
      "functions": {
        "E": [
          "Fe",
          "Se"
        ],
        "I": [
          "Fi",
          "Ni"
        ]
      }
    },
    {
      "id": 2,
      "question": "When pondering a situation or solving a problem, do you usually focus on concrete facts and details, or on patterns and possibilities?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 3,
      "question": "Would you rather be 'stuck in a rut' or have your 'head in the clouds' when trying to find a solution to something?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 4,
      "question": "Are you more guided by objective principles and logic, or by personal values and the feelings of others?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 5,
      "question": "What is more likely to win you over - a convincing argument or a heartfelt appeal?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 6,
      "question": "Do you prefer to have strict deadlines to stick to or let motivation guide your work?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 7,
      "question": "When planning a trip, do you usually prefer to have a detailed itinerary, or leave things open for spontaneous adventures?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 8,
      "question": "After long periods of social interaction, do you usually feel energized and refreshed, or drained and in need of alone time?",
      "dichotomy": "E/I",
      "functions": {
        "E": [
          "Fe",
          "Se"
        ],
        "I": [
          "Fi",
          "Ni"
        ]
      }
    },
    {
      "id": 9,
      "question": "Do you seek people who are sensible and realistic, or imaginative and innovative?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 10,
      "question": "Are you more attracted to feasible solutions based on practical experience, or to visionary ideas that challenge the status quo?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 11,
      "question": "When judging a tricky situation, do you usually fall back on laws and objective criteria, or on empathy and the circumstances involved?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 12,
      "question": "When approaching others with differing opinions, do you usually prioritize being truthful and direct, or being tactful and considerate?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 13,
      "question": "Do you tend to be a punctual person who values schedules, or a more laid-back person who goes with the flow?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 14,
      "question": "Do you tend to keep your environment neat and organized, or keep it messy or chaotic?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 15,
      "question": "Do you find yourself eager to connect with people and share experiences, or more reserved and reflective, preferring deeper one-on-one interactions?",
      "dichotomy": "E/I",
      "functions": {
        "E": [
          "Fe",
          "Se"
        ],
        "I": [
          "Fi",
          "Ni"
        ]
      }
    },
    {
      "id": 16,
      "question": "With daily or ordinary tasks, do you tend to do them the usual, well-known way or look for new and different approaches?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 17,
      "question": "Do you appreciate straight-forward, direct communication or more nuanced, layered conversations and the use of analogies?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 18,
      "question": "In a group discussion what appeals to you more — consistency of thought or harmony among participants?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 19,
      "question": "What comes to you more naturally — making judgements based logical reasoning or your values and social impact?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 20,
      "question": "Do you often leave things open-ended or won't rest until a resolution is reached?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 21,
      "question": "Do you consider yourself a serious, determined person or more approachable and easy-going?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 22,
      "question": "Do you tend to rehearse what you’ll say in social situations, or do you prefer to improvise as you go?",
      "dichotomy": "E/I",
      "functions": {
        "E": [
          "Fe",
          "Se"
        ],
        "I": [
          "Fi",
          "Ni"
        ]
      }
    },
    {
      "id": 23,
      "question": "When you encounter facts or statistics, how do you usually think about them — as self-contained pieces of information, or as clues pointing toward a bigger idea?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 24,
      "question": "How do you feel about visionaries and dreamers — do you admire their creativity, or find them impractical?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 25,
      "question": "When confronted with a tough decision, do you act cool-headed or warm-hearted?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 26,
      "question": "When facing conflict, do you prioritize being just and fair, or kind and merciful?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 27,
      "question": "When things are unfolding in your life, do you usually prefer to guide events through careful planning and choice, or let them happen naturally by chance?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 28,
      "question": "Does the opportunity and ability to do something appeal to you more than the satisfaction of finishing it?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 29,
      "question": "In a social gathering, do you usually find yourself initiating conversations or waiting for others to approach you?",
      "dichotomy": "E/I",
      "functions": {
        "E": [
          "Fe",
          "Se"
        ],
        "I": [
          "Fi",
          "Ni"
        ]
      }
    },
    {
      "id": 30,
      "question": "How often do you question things deemed as 'common sense' — do you usually accept them at face value, or look for alternative perspectives?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 31,
      "question": "Do you think children should be encouraged to explore and imagine, or to focus on being useful to their households?",
      "dichotomy": "S/N",
      "functions": {
        "S": [
          "Si",
          "Se"
        ],
        "N": [
          "Ni",
          "Ne"
        ]
      }
    },
    {
      "id": 32,
      "question": "When making important decisions, do you usually base it on your known standards or on how you are feeling in the moment?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 33,
      "question": "With others and with yourself, do you tend to be more firm and objective, or compassionate and gentle?",
      "dichotomy": "T/F",
      "functions": {
        "T": [
          "Ti",
          "Te"
        ],
        "F": [
          "Fi",
          "Fe"
        ]
      }
    },
    {
      "id": 34,
      "question": "What is a more important skill to you — the ability to organize and complete tasks, or the ability to adapt and respond to new information?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    },
    {
      "id": 35,
      "question": "When you start a new project, do you usually prefer to plan it out step by step, or choose a starting point to dive in and adjust as you go?",
      "dichotomy": "J/P",
      "functions": {
        "J": [
          "Te",
          "Si"
        ],
        "P": [
          "Ne",
          "Ti"
        ]
      }
    }
]